Repository: Mr-WhoAm-I/DataLink
Catalog: Resources/Resource.*.resx
Languages: ru

# Error_CsvFileAccess
source: Cannot access the CSV file.
ru: Не удалось получить доступ к файлу CSV.

# Error_CsvPartialWarning
source: {0} records were not processed. Reason: the number of fields does not match the expected.
ru: Не было обработано {0} записей. Причина: количество полей не совпадает с ожидаемым.

# Error_DbConnection
source: Database connection failed.
ru: Ошибка подключения к базе данных.

# Error_ExportData
source: Error occurred while preparing data for export.
ru: Ошибка при формировании данных для экспорта.

# Error_ExportFile
source: Failed to create or save the export file.
ru: Не удалось создать или сохранить файл.

# Error_ExportFileAccess
source: Insufficient permissions to write to the selected folder.
ru: Недостаточно прав для записи в выбранную папку.

# Error_ExportFileOpen
source: File is open in another program.
ru: Файл открыт в другой программе.

# Error_ExportFormat
source: Invalid file format.
ru: Неверный формат файла.

# Error_ExportMemory
source: Not enough memory to export large data.
ru: Недостаточно памяти для экспорта большого объёма данных.

# Error_ExportNoData
source: No data available to export.
ru: Нет данных для экспорта.

# Error_Generic
source: An unexpected error occurred.
ru: Произошла непредвиденная ошибка.

# Error_InvalidDate
source: Invalid date format in CSV.
ru: Неверный формат даты в CSV.

# Error_InvalidTextField
source: Text field contains invalid characters.
ru: Текстовое поле содержит недопустимые символы.

# Export_Canceled
source: Export canceled by user.
ru: Экспорт отменён пользователем.

# Export_CanceledTitle
source: Canceled
ru: Отмена

# Export_Success
source: Data successfully exported.
ru: Данные успешно экспортированы.

# Header_City
source: City
ru: Город

# Header_Country
source: Country
ru: Страна

# Header_Date
source: Date
ru: Дата

# Header_FirstName
source: First Name
ru: Имя

# Header_LastName
source: Last Name
ru: Фамилия

# Header_SurName
source: Middle Name
ru: Отчество

# Import_Canceled
source: Import canceled by user
ru: Импорт отменен пользователем

# Error_InvalidDateRange
source: Start date cannot be later than end date.
ru: Начальная дата не может быть позже конечной.
